Revit 2024 API
DimensionType.GetUnitsFormatOptions Method
 Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public FormatOptions GetUnitsFormatOptions()
Visual Basic
Public Function GetUnitsFormatOptions As FormatOptions
Visual C++
public:
FormatOptions^ GetUnitsFormatOptions()
Return Value
 A copy of the FormatOptions.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace